GopalSaraf/Practicals/PSDL/include/proc/pic16f15356.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 031Ah
// bitfield definitions
PWM4CON_POL_POSN                         equ 0004h
PWM4CON_POL_POSITION                     equ 0004h
PWM4CON_POL_SIZE                         equ 0001h
PWM4CON_POL_LENGTH                       equ 0001h
PWM4CON_POL_MASK                         equ 0010h
PWM4CON_OUT_POSN                         equ 0005h
PWM4CON_OUT_POSITION                     equ 0005h
PWM4CON_OUT_SIZE                         equ 0001h
PWM4CON_OUT_LENGTH                       equ 0001h
PWM4CON_OUT_MASK                         equ 0020h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
PWM5DCL                                  equ 031Ch
// bitfield definitions
PWM5DCL_DC_POSN                          equ 0006h
PWM5DCL_DC_POSITION                      equ 0006h
PWM5DCL_DC_SIZE                          equ 0002h
PWM5DCL_DC_LENGTH                        equ 0002h
PWM5DCL_DC_MASK                          equ 00C0h
PWM5DCL_DC0_POSN                         equ 0006h
PWM5DCL_DC0_POSITION                     equ 0006h
PWM5DCL_DC0_SIZE                         equ 0001h
PWM5DCL_DC0_LENGTH                       equ 0001h
PWM5DCL_DC0_MASK                         equ 0040h
PWM5DCL_DC1_POSN                         equ 0007h
PWM5DCL_DC1_POSITION                     equ 0007h
PWM5DCL_DC1_SIZE                         equ 0001h
PWM5DCL_DC1_LENGTH                       equ 0001h
PWM5DCL_DC1_MASK                         equ 0080h
PWM5DCL_PWM5DC0_POSN                     equ 0006h
PWM5DCL_PWM5DC0_POSITION                 equ 0006h
PWM5DCL_PWM5DC0_SIZE                     equ 0001h
PWM5DCL_PWM5DC0_LENGTH                   equ 0001h
PWM5DCL_PWM5DC0_MASK                     equ 0040h
PWM5DCL_PWM5DC1_POSN                     equ 0007h
PWM5DCL_PWM5DC1_POSITION                 equ 0007h
PWM5DCL_PWM5DC1_SIZE                     equ 0001h
PWM5DCL_PWM5DC1_LENGTH                   equ 0001h
PWM5DCL_PWM5DC1_MASK                     equ 0080h
PWM5DCL_PWMPW0_POSN                      equ 0006h
PWM5DCL_PWMPW0_POSITION                  equ 0006h
PWM5DCL_PWMPW0_SIZE                      equ 0001h
PWM5DCL_PWMPW0_LENGTH                    equ 0001h
PWM5DCL_PWMPW0_MASK                      equ 0040h
PWM5DCL_PWMPW1_POSN                      equ 0007h
PWM5DCL_PWMPW1_POSITION                  equ 0007h
PWM5DCL_PWMPW1_SIZE                      equ 0001h
PWM5DCL_PWMPW1_LENGTH                    equ 0001h
PWM5DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
PWM5DCH                                  equ 031Dh
// bitfield definitions
PWM5DCH_DC_POSN                          equ 0000h
PWM5DCH_DC_POSITION                      equ 0000h
PWM5DCH_DC_SIZE                          equ 0008h
PWM5DCH_DC_LENGTH                        equ 0008h
PWM5DCH_DC_MASK                          equ 00FFh
PWM5DCH_DC2_POSN                         equ 0000h
PWM5DCH_DC2_POSITION                     equ 0000h
PWM5DCH_DC2_SIZE                         equ 0001h
PWM5DCH_DC2_LENGTH                       equ 0001h
PWM5DCH_DC2_MASK                         equ 0001h
PWM5DCH_DC3_POSN                         equ 0001h
PWM5DCH_DC3_POSITION                     equ 0001h
PWM5DCH_DC3_SIZE                         equ 0001h
PWM5DCH_DC3_LENGTH                       equ 0001h
PWM5DCH_DC3_MASK                         equ 0002h
PWM5DCH_DC4_POSN                         equ 0002h
PWM5DCH_DC4_POSITION                     equ 0002h
PWM5DCH_DC4_SIZE                         equ 0001h
PWM5DCH_DC4_LENGTH                       equ 0001h
PWM5DCH_DC4_MASK                         equ 0004h
PWM5DCH_DC5_POSN                         equ 0003h
PWM5DCH_DC5_POSITION                     equ 0003h
PWM5DCH_DC5_SIZE                         equ 0001h
PWM5DCH_DC5_LENGTH                       equ 0001h
PWM5DCH_DC5_MASK                         equ 0008h
PWM5DCH_DC6_POSN                         equ 0004h
PWM5DCH_DC6_POSITION                     equ 0004h
PWM5DCH_DC6_SIZE                         equ 0001h
PWM5DCH_DC6_LENGTH                       equ 0001h
PWM5DCH_DC6_MASK                         equ 0010h
PWM5DCH_DC7_POSN                         equ 0005h
PWM5DCH_DC7_POSITION                     equ 0005h
PWM5DCH_DC7_SIZE                         equ 0001h
PWM5DCH_DC7_LENGTH                       equ 0001h
PWM5DCH_DC7_MASK                         equ 0020h
PWM5DCH_DC8_POSN                         equ 0006h
PWM5DCH_DC8_POSITION                     equ 0006h
PWM5DCH_DC8_SIZE                         equ 0001h
PWM5DCH_DC8_LENGTH                       equ 0001h
PWM5DCH_DC8_MASK                         equ 0040h
PWM5DCH_DC9_POSN                         equ 0007h
PWM5DCH_DC9_POSITION                     equ 0007h
PWM5DCH_DC9_SIZE                         equ 0001h
PWM5DCH_DC9_LENGTH                       equ 0001h
PWM5DCH_DC9_MASK                         equ 0080h
PWM5DCH_PWM5DC2_POSN                     equ 0000h
PWM5DCH_PWM5DC2_POSITION                 equ 0000h
PWM5DCH_PWM5DC2_SIZE                     equ 0001h
PWM5DCH_PWM5DC2_LENGTH                   equ 0001h
PWM5DCH_PWM5DC2_MASK                     equ 0001h
PWM5DCH_PWM5DC3_POSN                     equ 0001h
PWM5DCH_PWM5DC3_POSITION                 equ 0001h
PWM5DCH_PWM5DC3_SIZE                     equ 0001h
PWM5DCH_PWM5DC3_LENGTH                   equ 0001h
PWM5DCH_PWM5DC3_MASK                     equ 0002h
PWM5DCH_PWM5DC4_POSN                     equ 0002h
PWM5DCH_PWM5DC4_POSITION                 equ 0002h
PWM5DCH_PWM5DC4_SIZE                     equ 0001h
PWM5DCH_PWM5DC4_LENGTH                   equ 0001h
PWM5DCH_PWM5DC4_MASK                     equ 0004h
PWM5DCH_PWM5DC5_POSN                     equ 0003h
PWM5DCH_PWM5DC5_POSITION                 equ 0003h
PWM5DCH_PWM5DC5_SIZE                     equ 0001h
PWM5DCH_PWM5DC5_LENGTH                   equ 0001h
PWM5DCH_PWM5DC5_MASK                     equ 0008h
PWM5DCH_PWM5DC6_POSN                     equ 0004h
PWM5DCH_PWM5DC6_POSITION                 equ 0004h
PWM5DCH_PWM5DC6_SIZE                     equ 0001h
PWM5DCH_PWM5DC6_LENGTH                   equ 0001h
PWM5DCH_PWM5DC6_MASK                     equ 0010h
PWM5DCH_PWM5DC7_POSN                     equ 0005h
PWM5DCH_PWM5DC7_POSITION                 equ 0005h
PWM5DCH_PWM5DC7_SIZE                     equ 0001h
PWM5DCH_PWM5DC7_LENGTH                   equ 0001h
PWM5DCH_PWM5DC7_MASK                     equ 0020h
PWM5DCH_PWM5DC8_POSN                     equ 0006h
PWM5DCH_PWM5DC8_POSITION                 equ 0006h
PWM5DCH_PWM5DC8_SIZE                     equ 0001h
PWM5DCH_PWM5DC8_LENGTH                   equ 0001h
PWM5DCH_PWM5DC8_MASK                     equ 0040h
PWM5DCH_PWM5DC9_POSN                     equ 0007h
PWM5DCH_PWM5DC9_POSITION                 equ 0007h
PWM5DCH_PWM5DC9_SIZE                     equ 0001h
PWM5DCH_PWM5DC9_LENGTH                   equ 0001h
PWM5DCH_PWM5DC9_MASK                     equ 0080h
PWM5DCH_PWMPW2_POSN                      equ 0000h
PWM5DCH_PWMPW2_POSITION                  equ 0000h
PWM5DCH_PWMPW2_SIZE                      equ 0001h
PWM5DCH_PWMPW2_LENGTH                    equ 0001h
PWM5DCH_PWMPW2_MASK                      equ 0001h
PWM5DCH_PWMPW3_POSN                      equ 0001h
PWM5DCH_PWMPW3_POSITION                  equ 0001h
PWM5DCH_PWMPW3_SIZE                      equ 0001h
PWM5DCH_PWMPW3_LENGTH                    equ 0001h
PWM5DCH_PWMPW3_MASK                      equ 0002h
PWM5DCH_PWMPW4_POSN                      equ 0002h
PWM5DCH_PWMPW4_POSITION                  equ 0002h
PWM5DCH_PWMPW4_SIZE                      equ 0001h
PWM5DCH_PWMPW4_LENGTH                    equ 0001h
PWM5DCH_PWMPW4_MASK                      equ 0004h
PWM5DCH_PWMPW5_POSN                      equ 0003h
PWM5DCH_PWMPW5_POSITION                  equ 0003h
PWM5DCH_PWMPW5_SIZE                      equ 0001h
PWM5DCH_PWMPW5_LENGTH                    equ 0001h
PWM5DCH_PWMPW5_MASK                      equ 0008h
PWM5DCH_PWMPW6_POSN                      equ 0004h
PWM5DCH_PWMPW6_POSITION                  equ 0004h
PWM5DCH_PWMPW6_SIZE                      equ 0001h
PWM5DCH_PWMPW6_LENGTH                    equ 0001h
PWM5DCH_PWMPW6_MASK                      equ 0010h
PWM5DCH_PWMPW7_POSN                      equ 0005h
PWM5DCH_PWMPW7_POSITION                  equ 0005h
PWM5DCH_PWMPW7_SIZE                      equ 0001h
PWM5DCH_PWMPW7_LENGTH                    equ 0001h
PWM5DCH_PWMPW7_MASK                      equ 0020h
PWM5DCH_PWMPW8_POSN                      equ 0006h
PWM5DCH_PWMPW8_POSITION                  equ 0006h
PWM5DCH_PWMPW8_SIZE                      equ 0001h
PWM5DCH_PWMPW8_LENGTH                    equ 0001h
PWM5DCH_PWMPW8_MASK                      equ 0040h
PWM5DCH_PWMPW9_POSN                      equ 0007h
PWM5DCH_PWMPW9_POSITION                  equ 0007h
PWM5DCH_PWMPW9_SIZE                      equ 0001h
PWM5DCH_PWMPW9_LENGTH                    equ 0001h
PWM5DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM5CON
#define PWM5CON PWM5CON
PWM5CON                                  equ 031Eh
// bitfield definitions
PWM5CON_POL_POSN                         equ 0004h
PWM5CON_POL_POSITION                     equ 0004h
PWM5CON_POL_SIZE                         equ 0001h
PWM5CON_POL_LENGTH                       equ 0001h
PWM5CON_POL_MASK                         equ 0010h
PWM5CON_OUT_POSN                         equ 0005h
PWM5CON_OUT_POSITION                     equ 0005h
PWM5CON_OUT_SIZE                         equ 0001h
PWM5CON_OUT_LENGTH                       equ 0001h
PWM5CON_OUT_MASK                         equ 0020h
PWM5CON_EN_POSN                          equ 0007h
PWM5CON_EN_POSITION                      equ 0007h
PWM5CON_EN_SIZE                          equ 0001h
PWM5CON_EN_LENGTH                        equ 0001h
PWM5CON_EN_MASK                          equ 0080h
PWM5CON_PWM5POL_POSN                     equ 0004h
PWM5CON_PWM5POL_POSITION                 equ 0004h
PWM5CON_PWM5POL_SIZE                     equ 0001h
PWM5CON_PWM5POL_LENGTH                   equ 0001h
PWM5CON_PWM5POL_MASK                     equ 0010h
PWM5CON_PWM5OUT_POSN                     equ 0005h
PWM5CON_PWM5OUT_POSITION                 equ 0005h
PWM5CON_PWM5OUT_SIZE                     equ 0001h
PWM5CON_PWM5OUT_LENGTH                   equ 0001h
PWM5CON_PWM5OUT_MASK                     equ 0020h
PWM5CON_PWM5EN_POSN                      equ 0007h
PWM5CON_PWM5EN_POSITION                  equ 0007h
PWM5CON_PWM5EN_SIZE                      equ 0001h
PWM5CON_PWM5EN_LENGTH                    equ 0001h
PWM5CON_PWM5EN_MASK                      equ 0080h

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 038Ch
// bitfield definitions
PWM6DCL_DC_POSN                          equ 0006h
PWM6DCL_DC_POSITION                      equ 0006h
PWM6DCL_DC_SIZE                          equ 0002h
PWM6DCL_DC_LENGTH                        equ 0002h
PWM6DCL_DC_MASK                          equ 00C0h
PWM6DCL_DC0_POSN                         equ 0006h
PWM6DCL_DC0_POSITION                     equ 0006h
PWM6DCL_DC0_SIZE                         equ 0001h
PWM6DCL_DC0_LENGTH                       equ 0001h
PWM6DCL_DC0_MASK                         equ 0040h
PWM6DCL_DC1_POSN                         equ 0007h
PWM6DCL_DC1_POSITION                     equ 0007h
PWM6DCL_DC1_SIZE                         equ 0001h
PWM6DCL_DC1_LENGTH                       equ 0001h
PWM6DCL_DC1_MASK                         equ 0080h
PWM6DCL_PWM6DC0_POSN                     equ 0006h
PWM6DCL_PWM6DC0_POSITION                 equ 0006h
PWM6DCL_PWM6DC0_SIZE                     equ 0001h
PWM6DCL_PWM6DC0_LENGTH                   equ 0001h
PWM6DCL_PWM6DC0_MASK                     equ 0040h
PWM6DCL_PWM6DC1_POSN                     equ 0007h
PWM6DCL_PWM6DC1_POSITION                 equ 0007h
PWM6DCL_PWM6DC1_SIZE                     equ 0001h
PWM6DCL_PWM6DC1_LENGTH                   equ 0001h
PWM6DCL_PWM6DC1_MASK                     equ 0080h
PWM6DCL_PWMPW0_POSN                      equ 0006h
PWM6DCL_PWMPW0_POSITION                  equ 0006h
PWM6DCL_PWMPW0_SIZE                      equ 0001h
PWM6DCL_PWMPW0_LENGTH                    equ 0001h
PWM6DCL_PWMPW0_MASK                      equ 0040h
PWM6DCL_PWMPW1_POSN                      equ 0007h
PWM6DCL_PWMPW1_POSITION                  equ 0007h
PWM6DCL_PWMPW1_SIZE                      equ 0001h
PWM6DCL_PWMPW1_LENGTH                    equ 0001h
PWM6DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 038Dh
// bitfield definitions
PWM6DCH_DC_POSN                          equ 0000h
PWM6DCH_DC_POSITION                      equ 0000h
PWM6DCH_DC_SIZE                          equ 0008h
PWM6DCH_DC_LENGTH                        equ 0008h
PWM6DCH_DC_MASK                          equ 00FFh
PWM6DCH_DC2_POSN                         equ 0000h
PWM6DCH_DC2_POSITION                     equ 0000h
PWM6DCH_DC2_SIZE                         equ 0001h
PWM6DCH_DC2_LENGTH                       equ 0001h
PWM6DCH_DC2_MASK                         equ 0001h
PWM6DCH_DC3_POSN                         equ 0001h
PWM6DCH_DC3_POSITION                     equ 0001h
PWM6DCH_DC3_SIZE                         equ 0001h
PWM6DCH_DC3_LENGTH                       equ 0001h
PWM6DCH_DC3_MASK                         equ 0002h
PWM6DCH_DC4_POSN                         equ 0002h
PWM6DCH_DC4_POSITION                     equ 0002h
PWM6DCH_DC4_SIZE                         equ 0001h
PWM6DCH_DC4_LENGTH                       equ 0001h
PWM6DCH_DC4_MASK                         equ 0004h
PWM6DCH_DC5_POSN                         equ 0003h
PWM6DCH_DC5_POSITION                     equ 0003h
PWM6DCH_DC5_SIZE                         equ 0001h
PWM6DCH_DC5_LENGTH                       equ 0001h
PWM6DCH_DC5_MASK                         equ 0008h
PWM6DCH_DC6_POSN                         equ 0004h
PWM6DCH_DC6_POSITION                     equ 0004h
PWM6DCH_DC6_SIZE                         equ 0001h
PWM6DCH_DC6_LENGTH                       equ 0001h
PWM6DCH_DC6_MASK                         equ 0010h
PWM6DCH_DC7_POSN                         equ 0005h
PWM6DCH_DC7_POSITION                     equ 0005h
PWM6DCH_DC7_SIZE                         equ 0001h
PWM6DCH_DC7_LENGTH                       equ 0001h
PWM6DCH_DC7_MASK                         equ 0020h
PWM6DCH_DC8_POSN                         equ 0006h
PWM6DCH_DC8_POSITION                     equ 0006h
PWM6DCH_DC8_SIZE                         equ 0001h
PWM6DCH_DC8_LENGTH                       equ 0001h
PWM6DCH_DC8_MASK                         equ 0040h
PWM6DCH_DC9_POSN                         equ 0007h
PWM6DCH_DC9_POSITION                     equ 0007h
PWM6DCH_DC9_SIZE                         equ 0001h
PWM6DCH_DC9_LENGTH                       equ 0001h
PWM6DCH_DC9_MASK                         equ 0080h
PWM6DCH_PWM6DC2_POSN                     equ 0000h
PWM6DCH_PWM6DC2_POSITION                 equ 0000h
PWM6DCH_PWM6DC2_SIZE                     equ 0001h
PWM6DCH_PWM6DC2_LENGTH                   equ 0001h
PWM6DCH_PWM6DC2_MASK                     equ 0001h
PWM6DCH_PWM6DC3_POSN                     equ 0001h
PWM6DCH_PWM6DC3_POSITION                 equ 0001h
PWM6DCH_PWM6DC3_SIZE                     equ 0001h
PWM6DCH_PWM6DC3_LENGTH                   equ 0001h
PWM6DCH_PWM6DC3_MASK                     equ 0002h
PWM6DCH_PWM6DC4_POSN                     equ 0002h
PWM6DCH_PWM6DC4_POSITION                 equ 0002h
PWM6DCH_PWM6DC4_SIZE                     equ 0001h
PWM6DCH_PWM6DC4_LENGTH                   equ 0001h
PWM6DCH_PWM6DC4_MASK                     equ 0004h
PWM6DCH_PWM6DC5_POSN                     equ 0003h
PWM6DCH_PWM6DC5_POSITION                 equ 0003h
PWM6DCH_PWM6DC5_SIZE                     equ 0001h
PWM6DCH_PWM6DC5_LENGTH                   equ 0001h
PWM6DCH_PWM6DC5_MASK                     equ 0008h
PWM6DCH_PWM6DC6_POSN                     equ 0004h
PWM6DCH_PWM6DC6_POSITION                 equ 0004h
PWM6DCH_PWM6DC6_SIZE                     equ 0001h
PWM6DCH_PWM6DC6_LENGTH                   equ 0001h
PWM6DCH_PWM6DC6_MASK                     equ 0010h
PWM6DCH_PWM6DC7_POSN                     equ 0005h
PWM6DCH_PWM6DC7_POSITION                 equ 0005h
PWM6DCH_PWM6DC7_SIZE                     equ 0001h
PWM6DCH_PWM6DC7_LENGTH                   equ 0001h
PWM6DCH_PWM6DC7_MASK                     equ 0020h
PWM6DCH_PWM6DC8_POSN                     equ 0006h
PWM6DCH_PWM6DC8_POSITION                 equ 0006h
PWM6DCH_PWM6DC8_SIZE                     equ 0001h
PWM6DCH_PWM6DC8_LENGTH                   equ 0001h
PWM6DCH_PWM6DC8_MASK                     equ 0040h
PWM6DCH_PWM6DC9_POSN                     equ 0007h
PWM6DCH_PWM6DC9_POSITION                 equ 0007h
PWM6DCH_PWM6DC9_SIZE                     equ 0001h
PWM6DCH_PWM6DC9_LENGTH                   equ 0001h
PWM6DCH_PWM6DC9_MASK                     equ 0080h
PWM6DCH_PWMPW2_POSN                      equ 0000h
PWM6DCH_PWMPW2_POSITION                  equ 0000h
PWM6DCH_PWMPW2_SIZE                      equ 0001h
PWM6DCH_PWMPW2_LENGTH                    equ 0001h
PWM6DCH_PWMPW2_MASK                      equ 0001h
PWM6DCH_PWMPW3_POSN                      equ 0001h
PWM6DCH_PWMPW3_POSITION                  equ 0001h
PWM6DCH_PWMPW3_SIZE                      equ 0001h
PWM6DCH_PWMPW3_LENGTH                    equ 0001h
PWM6DCH_PWMPW3_MASK                      equ 0002h
PWM6DCH_PWMPW4_POSN                      equ 0002h
PWM6DCH_PWMPW4_POSITION                  equ 0002h
PWM6DCH_PWMPW4_SIZE                      equ 0001h
PWM6DCH_PWMPW4_LENGTH                    equ 0001h
PWM6DCH_PWMPW4_MASK                      equ 0004h
PWM6DCH_PWMPW5_POSN                      equ 0003h
PWM6DCH_PWMPW5_POSITION                  equ 0003h
PWM6DCH_PWMPW5_SIZE                      equ 0001h
PWM6DCH_PWMPW5_LENGTH                    equ 0001h
PWM6DCH_PWMPW5_MASK                      equ 0008h
PWM6DCH_PWMPW6_POSN                      equ 0004h
PWM6DCH_PWMPW6_POSITION                  equ 0004h
PWM6DCH_PWMPW6_SIZE                      equ 0001h
PWM6DCH_PWMPW6_LENGTH                    equ 0001h
PWM6DCH_PWMPW6_MASK                      equ 0010h
PWM6DCH_PWMPW7_POSN                      equ 0005h
PWM6DCH_PWMPW7_POSITION                  equ 0005h
PWM6DCH_PWMPW7_SIZE                      equ 0001h
PWM6DCH_PWMPW7_LENGTH                    equ 0001h
PWM6DCH_PWMPW7_MASK                      equ 0020h
PWM6DCH_PWMPW8_POSN                      equ 0006h
PWM6DCH_PWMPW8_POSITION                  equ 0006h
PWM6DCH_PWMPW8_SIZE                      equ 0001h
PWM6DCH_PWMPW8_LENGTH                    equ 0001h
PWM6DCH_PWMPW8_MASK                      equ 0040h
PWM6DCH_PWMPW9_POSN                      equ 0007h
PWM6DCH_PWMPW9_POSITION                  equ 0007h
PWM6DCH_PWMPW9_SIZE                      equ 0001h
PWM6DCH_PWMPW9_LENGTH                    equ 0001h
PWM6DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM6CON
#define PWM6CON PWM6CON
PWM6CON                                  equ 038Eh
// bitfield definitions
PWM6CON_POL_POSN                         equ 0004h
PWM6CON_POL_POSITION                     equ 0004h
PWM6CON_POL_SIZE                         equ 0001h
PWM6CON_POL_LENGTH                       equ 0001h
PWM6CON_POL_MASK                         equ 0010h
PWM6CON_OUT_POSN                         equ 0005h
PWM6CON_OUT_POSITION                     equ 0005h
PWM6CON_OUT_SIZE                         equ 0001h
PWM6CON_OUT_LENGTH                       equ 0001h
PWM6CON_OUT_MASK                         equ 0020h
PWM6CON_EN_POSN                          equ 0007h
PWM6CON_EN_POSITION                      equ 0007h
PWM6CON_EN_SIZE                          equ 0001h
PWM6CON_EN_LENGTH                        equ 0001h
PWM6CON_EN_MASK                          equ 0080h
PWM6CON_PWM6POL_POSN                     equ 0004h
PWM6CON_PWM6POL_POSITION                 equ 0004h
PWM6CON_PWM6POL_SIZE                     equ 0001h
PWM6CON_PWM6POL_LENGTH                   equ 0001h
PWM6CON_PWM6POL_MASK                     equ 0010h
PWM6CON_PWM6OUT_POSN                     equ 0005h
PWM6CON_PWM6OUT_POSITION                 equ 0005h
PWM6CON_PWM6OUT_SIZE                     equ 0001h
PWM6CON_PWM6OUT_LENGTH                   equ 0001h
PWM6CON_PWM6OUT_MASK                     equ 0020h
PWM6CON_PWM6EN_POSN                      equ 0007h
PWM6CON_PWM6EN_POSITION                  equ 0007h
PWM6CON_PWM6EN_SIZE                      equ 0001h
PWM6CON_PWM6EN_LENGTH                    equ 0001h
PWM6CON_PWM6EN_MASK                      equ 0080h

